; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	instrument3 - instrument
	thermograph1 - mode
	image0 - mode
	Star1 - direction
	Star2 - direction
	Star4 - direction
	Star6 - direction
	Star7 - direction
	GroundStation0 - direction
	GroundStation5 - direction
	GroundStation3 - direction
	Planet8 - direction
	Star9 - direction
	Planet10 - direction
	Planet11 - direction
	Phenomenon12 - direction
	Planet13 - direction
	Phenomenon14 - direction
	Star15 - direction
)
(:init
	(supports instrument0 thermograph1)
	(supports instrument0 image0)
	(calibration_target instrument0 GroundStation5)
	(calibration_target instrument0 Star6)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet10)
	(supports instrument1 image0)
	(calibration_target instrument1 Star7)
	(supports instrument2 image0)
	(calibration_target instrument2 GroundStation3)
	(calibration_target instrument2 GroundStation0)
	(supports instrument3 thermograph1)
	(supports instrument3 image0)
	(calibration_target instrument3 GroundStation3)
	(calibration_target instrument3 GroundStation5)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star15)
)
(:goal (and
	(pointing satellite1 Planet10)
	(have_image Planet8 image0)
	(have_image Star9 image0)
	(have_image Planet10 thermograph1)
	(have_image Planet11 thermograph1)
	(have_image Phenomenon12 image0)
	(have_image Planet13 image0)
	(have_image Phenomenon14 thermograph1)
	(have_image Star15 thermograph1)
))

)

; plan
1. (turn_to satellite1 groundstation3 star15)
   deleted: (pointing satellite1 star15)
   added: (pointing satellite1 groundstation3)
   goals met: 0 of 9
2. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 0 of 9
3. (calibrate satellite1 instrument3 groundstation3)
   added: (calibrated instrument3)
   goals met: 0 of 9
4. (turn_to satellite1 planet11 groundstation3)
   deleted: (pointing satellite1 groundstation3)
   added: (pointing satellite1 planet11)
   goals met: 0 of 9
5. (take_image satellite1 planet11 instrument3 thermograph1)
   added: (have_image planet11 thermograph1)
   goals met: 1 of 9
6. (turn_to satellite1 phenomenon14 planet11)
   deleted: (pointing satellite1 planet11)
   added: (pointing satellite1 phenomenon14)
   goals met: 1 of 9
7. (take_image satellite1 phenomenon14 instrument3 thermograph1)
   added: (have_image phenomenon14 thermograph1)
   goals met: 2 of 9
8. (turn_to satellite1 phenomenon12 phenomenon14)
   deleted: (pointing satellite1 phenomenon14)
   added: (pointing satellite1 phenomenon12)
   goals met: 2 of 9
9. (take_image satellite1 phenomenon12 instrument3 image0)
   added: (have_image phenomenon12 image0)
   goals met: 3 of 9
10. (turn_to satellite1 planet13 phenomenon12)
   deleted: (pointing satellite1 phenomenon12)
   added: (pointing satellite1 planet13)
   goals met: 3 of 9
11. (take_image satellite1 planet13 instrument3 image0)
   added: (have_image planet13 image0)
   goals met: 4 of 9
12. (turn_to satellite1 planet8 planet13)
   deleted: (pointing satellite1 planet13)
   added: (pointing satellite1 planet8)
   goals met: 4 of 9
13. (take_image satellite1 planet8 instrument3 image0)
   added: (have_image planet8 image0)
   goals met: 5 of 9
14. (turn_to satellite1 star15 planet8)
   deleted: (pointing satellite1 planet8)
   added: (pointing satellite1 star15)
   goals met: 5 of 9
15. (take_image satellite1 star15 instrument3 thermograph1)
   added: (have_image star15 thermograph1)
   goals met: 6 of 9
16. (turn_to satellite1 star9 star15)
   deleted: (pointing satellite1 star15)
   added: (pointing satellite1 star9)
   goals met: 6 of 9
17. (take_image satellite1 star9 instrument3 image0)
   added: (have_image star9 image0)
   goals met: 7 of 9
18. (turn_to satellite1 planet10 star9)
   deleted: (pointing satellite1 star9)
   added: (pointing satellite1 planet10)
   goals met: 8 of 9
19. (take_image satellite1 planet10 instrument3 thermograph1)
   added: (have_image planet10 thermograph1)
   goals met: 9 of 9
